brew 'bash-completion'
brew 'colordiff'
brew 'coreutils'
brew 'cloc'
brew 'curl'
brew 'ffmpeg'
brew 'git'
brew 'git-flow'
brew 'go'
brew 'graphviz'
brew 'hub'
brew 'jq'
brew 'mas'
brew 'nmap'
brew 'node'
brew 'readline'
brew 'postgresql'
brew 'python'
brew 'python3'
brew 'rclone'
brew 'stow'
brew 'the_silver_searcher'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'unrar'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'youtube-dl'
