brew 'android-platform-tools'
brew 'ant'
brew 'apgdiff'
brew 'awscli'
brew 'bash'
brew 'bash-completion'
brew 'colordiff'
brew 'coreutils'
brew 'cowsay'
brew 'cloc'
brew 'curl'
brew 'direnv'
brew 'erlang'
brew 'ffmpeg'
brew 'fish'
brew 'git'
brew 'git-flow'
brew 'go'
brew 'graphviz'
brew 'hub'
brew 'jq'
brew 'ledger'
brew 'mas'
brew 'mosh'
brew 'nmap'
brew 'node'
brew 'readline'
brew 'pandoc'
brew 'postgresql'
brew 'pwgen'
brew 'pyenv'
brew 'python'
brew 'python3'
brew 'rclone'
brew 'shellcheck'
brew 'stow'
brew 'task'
brew 'the_silver_searcher'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'unrar'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'

tap 'burntsushi/ripgrep', 'https://github.com/BurntSushi/ripgrep.git'
brew 'burntsushi/ripgrep/ripgrep-bin'

tap 'restic/restic'
brew 'restic'
