work = system("dsconfigad -show | grep --quiet babylonhealth")
home = !work

tap 'homebrew/cask'
cask 'java8'

tap 'babylonhealth/babylon' if work
tap 'burntsushi/ripgrep', 'https://github.com/BurntSushi/ripgrep.git'
tap 'heroku/brew'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'lokalise/brew'
tap 'rupert/private'
tap 'rupert/repo'

brew 'awscli'
brew 'babylonhealth/babylon/shipcat' if work
brew 'bash'
brew 'burntsushi/ripgrep/ripgrep-bin'
brew 'circleci'
brew 'cloc'
brew 'colordiff'
brew 'coreutils'
brew 'curl'
brew 'diff-so-fancy'
brew 'direnv'
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'go'
brew 'gpg'
brew 'hugo'
brew 'imagemagick'
brew 'jq'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'mas'
brew 'nmap'
brew 'node'
brew 'pgcli'
brew 'postgresql'
brew 'pre-commit'
brew 'pwgen'
brew 'python@2'
brew 'python@3.7'
brew 'readline'
brew 'redis'
brew 'rustup-init'
brew 'shellcheck'
brew 'sqlite'
brew 'ssh-audit'
brew 'stow'
brew 'syncthing'
brew 'task'
brew 'teleport'
brew 'telnet'
brew 'vault'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'zlib'
brew 'zsh'

cask '1password'
cask 'anki'
cask 'anybar'
cask 'atom'
cask 'balenaetcher'
cask 'docker'
cask 'font-fira-code'
cask 'font-roboto'
cask 'font-roboto-mono'
cask 'font-source-code-pro'
cask 'garmin-express' if home
cask 'google-chrome'
cask 'gpxsee' if home
cask 'intellij-idea' if work
cask 'intellij-idea-ce' if home
cask 'pycharm' if work
cask 'pycharm-ce' if home
cask 'rupert/private/mischief-free'
cask 'skype' if work
cask 'slack' if work
cask 'spectacle'
cask 'spotify'
cask 'sublime-text'
cask 'visual-studio-code'
cask 'vlc'
cask 'wacom-tablet'
cask 'whatsapp' if home
cask 'zoomus' if work
cask 'zwift' if home

mas 'XCode', id: 497799835
