work = system("dsconfigad -show | grep --quiet babylonhealth")
home = !work

tap 'babylonpartners/babylon'
tap 'burntsushi/ripgrep', 'https://github.com/BurntSushi/ripgrep.git'
tap 'heroku/brew'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'lokalise/brew'
tap 'rupert/private'
tap 'rupert/repo'

brew 'ansible'
brew 'apgdiff'
brew 'asciinema'
brew 'awscli'
brew 'bash-completion'
brew 'bat'
brew 'bazel'
brew 'burntsushi/ripgrep/ripgrep-bin'
brew 'circleci'
brew 'clang-format'
brew 'cloc'
brew 'colordiff'
brew 'coreutils'
brew 'cowsay'
brew 'ctags'
brew 'ctop'
brew 'curl'
brew 'dep'
brew 'diff-so-fancy'
brew 'direnv'
brew 'fd'
brew 'ffmpeg'
brew 'fish'
brew 'flake8'
brew 'fzf'
brew 'git'
brew 'gnuplot'
brew 'go'
brew 'go-jira'
brew 'gpg'
brew 'heroku/brew/heroku'
brew 'httpie'
brew 'hub'
brew 'hugo'
brew 'imagemagick'
brew 'jq'
brew 'jrnl'
brew 'keychain'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'lcov'
brew 'ledger'
brew 'lokalise/brew/lokalise'
brew 'mas'
brew 'nmap'
brew 'node'
brew 'optipng'
brew 'pandoc'
brew 'pgcli'
brew 'pipenv'
brew 'postgresql'
brew 'pre-commit'
brew 'pwgen'
brew 'pyenv'
brew 'python2'
brew 'python3'
brew 'readline'
brew 'restic'
brew 'rsync'
brew 'rupert/repo/google-photos-backup'
brew 'rustup-init'
brew 'sbt'
brew 'shellcheck'
brew 'sqlite'
brew 'ssh-audit'
brew 'stow'
brew 'syncthing'
brew 'telnet'
brew 'terraform'
brew 'tig'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'vault'
brew 'vim'
brew 'watch'
brew 'webpack'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'zbar'
brew 'zlib'

cask '1password'
cask 'anki'
cask 'anybar'
cask 'arq' if home
cask 'atom'
cask 'balenaetcher'
cask 'deluge' if home
cask 'docker'
cask 'font-fira-code'
cask 'font-roboto'
cask 'font-roboto-mono'
cask 'font-source-code-pro'
cask 'garmin-express' if home
cask 'google-chrome'
cask 'google-hangouts'
cask 'gpxsee' if home
cask 'insomnia'
cask 'intellij-idea' if work
cask 'intellij-idea-ce' if home
cask 'java8'
cask 'musicbrainz-picard' if home
cask 'paw'
cask 'pycharm' if work
cask 'pycharm-ce' if home
cask 'rupert/private/mischief-free'
cask 'skype' if work
cask 'slack' if work
cask 'sonos' if home
cask 'spectacle'
cask 'spotify'
cask 'sublime-text'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
cask 'wacom-tablet'
cask 'whatsapp' if home
cask 'zoomus' if work
cask 'zwift' if home

mas 'Canopy', id: 1419224245
mas 'Encrypto', id: 935235287 if work
mas 'XCode', id: 497799835
